Repository: justinrow-art/quota-harbor
Catalog: CodexQuotaMonitor/Resources/Localizable.xcstrings
Source language: zh_hant
Languages: de, en, es, fr, ja, ko, zh_hans

# onboarding.error.registration_failed
source: 無法啟用登入時自動啟動，請到「系統設定」檢查登入項目，或稍後在設定中重試。
de: „Bei Anmeldung öffnen“ konnte nicht aktiviert werden. Anmeldeobjekte prüfen oder später erneut versuchen.
en: Open at Login could not be enabled. Check Login Items in System Settings or try again later in Settings.
es: No se pudo activar Abrir al iniciar sesión. Revisa los ítems de inicio o inténtalo más tarde.
fr: Impossible d’activer l’ouverture à la connexion. Vérifiez les éléments d’ouverture ou réessayez plus tard.
ja: ログイン時に開く設定を有効にできませんでした。システム設定のログイン項目を確認するか、後で設定画面からやり直してください。
ko: 로그인 시 열기를 활성화할 수 없습니다. 시스템 설정에서 로그인 항목을 확인하거나 나중에 다시 시도하세요.
zh_hans: 无法启用登录时自动启动，请在“系统设置”中检查登录项，或稍后在设置中重试。

# onboarding.error.unregistration_failed
source: 系統未能關閉登入項目，請到「系統設定」確認。
de: Das System konnte das Anmeldeobjekt nicht deaktivieren. In den Systemeinstellungen prüfen.
en: The system could not turn off the login item. Confirm it in System Settings.
es: El sistema no pudo desactivar el ítem de inicio. Confírmalo en Ajustes del Sistema.
fr: Le système n’a pas pu désactiver l’élément d’ouverture. Vérifiez-le dans Réglages Système.
ja: システムがログイン項目をオフにできませんでした。システム設定で確認してください。
ko: 시스템에서 로그인 항목을 끌 수 없습니다. 시스템 설정에서 확인하세요.
zh_hans: 系统未能关闭登录项，请在“系统设置”中确认。

# onboarding.error.persistence_failed
source: 無法儲存設定，導覽尚未完成。
de: Die Einstellungen konnten nicht gesichert werden; die Einrichtung ist nicht abgeschlossen.
en: Settings could not be saved, so setup is not complete.
es: No se pudieron guardar los ajustes; la configuración no ha terminado.
fr: Impossible d’enregistrer les réglages ; la configuration n’est pas terminée.
ja: 設定を保存できなかったため、セットアップは完了していません。
ko: 설정을 저장할 수 없어 설정이 완료되지 않았습니다.
zh_hans: 无法保存设置，设置向导尚未完成。

# onboarding.operation_warning
source: 系統回報過程異常，已依目前狀態顯示。
de: Das System meldete ein unerwartetes Ergebnis; der aktuelle Status wird angezeigt.
en: The system reported an unexpected result; the current status is shown.
es: El sistema devolvió un resultado inesperado; se muestra el estado actual.
fr: Le système a renvoyé un résultat inattendu ; l’état actuel est affiché.
ja: システムから予期しない結果が返されたため、現在の状態を表示しています。
ko: 시스템에서 예기치 않은 결과를 보고하여 현재 상태를 표시합니다.
zh_hans: 系统返回了异常结果，已按当前状态显示。

# onboarding.finish
source: 完成
de: Fertig
en: Finish
es: Finalizar
fr: Terminer
ja: 完了
ko: 완료

# onboarding.finish_and_enable
source: 完成並啟用
de: Abschließen und aktivieren
en: Finish and Enable
es: Finalizar y activar
fr: Terminer et activer
ja: 完了して有効にする
ko: 완료 및 활성화
zh_hans: 完成并启用

# settings.menu_bar.display_mode
source: 選單列顯示
de: Menüleistenanzeige
en: Menu Bar Display
es: Visualización de la barra de menús
fr: Affichage de la barre des menus
ja: メニューバー表示
ko: 메뉴 막대 표시
zh_hans: 菜单栏显示

# settings.menu_bar.display_mode.automatic
source: 自動
de: Automatisch
en: Automatic
es: Automático
fr: Automatique
ko: 자동
zh_hans: 自动

# settings.menu_bar.display_mode.primary
source: 主要平台
de: Primär
en: Primary
es: Principal
fr: Principal
ja: 優先
ko: 기본

# settings.menu_bar.display_mode.full
source: 完整
de: Vollständig
en: Full
es: Completo
fr: Complet
ja: フル
ko: 전체

# settings.menu_bar.primary_provider
source: 主要平台
de: Primärer Anbieter
en: Primary Provider
es: Proveedor principal
fr: Fournisseur principal
ja: 優先プロバイダ
ko: 기본 제공업체

# settings.menu_bar.all_providers_explanation
source: 儀表板與面板會顯示固定啟用的 Codex，以及你選用的 Claude Code 額度與狀態。
de: Dashboard und Panel zeigen den stets aktivierten Codex-Anbieter sowie bei Auswahl Kontingent und Status von Claude Code.
en: The dashboard and panel show the always-enabled Codex provider plus Claude Code quota and status when selected.
es: El panel de control muestra Codex, siempre activo, y la cuota y el estado de Claude Code cuando se selecciona.
fr: Le tableau de bord affiche Codex, toujours activé, ainsi que le quota et l’état de Claude Code lorsqu’il est sélectionné.
ja: ダッシュボードとパネルには常に有効な Codex と、選択した場合は Claude Code の利用枠と状態が表示されます。
ko: 대시보드와 패널에는 항상 활성화된 Codex와 선택한 경우 Claude Code 할당량 및 상태가 표시됩니다.
zh_hans: 仪表板和面板会显示固定启用的 Codex，以及你选用的 Claude Code 额度与状态。

# settings.menu_bar.full_warning
source: 完整模式在 macOS 選單列擁擠時可能被系統隱藏。
de: macOS kann den vollständigen Modus ausblenden, wenn die Menüleiste voll ist.
en: Full mode may be hidden by macOS when the menu bar is crowded.
es: macOS puede ocultar el modo completo cuando la barra de menús está llena.
fr: macOS peut masquer le mode complet lorsque la barre des menus est encombrée.
ja: フルモードは、macOS のメニューバーが混み合うとシステムによって隠されることがあります。
ko: 전체 모드는 macOS 메뉴 막대가 혼잡할 때 시스템에 의해 가려질 수 있습니다.
zh_hans: 完整模式在 macOS 菜单栏拥挤时可能被系统隐藏。

# settings.menu_bar.position_help
source: 按住 Command 拖曳可調整位置。App 僅使用 macOS 公開的還原機制，因此位置只能盡力恢復，無法保證永遠固定在最左側。
de: Halte beim Ziehen die Command-Taste gedrückt, um die Position zu ändern. Die App nutzt nur die öffentliche Wiederherstellung von macOS; die Position wird daher nach Möglichkeit wiederhergestellt und ganz links nicht garantiert.
en: Hold Command while dragging to reposition. The app uses only macOS public restoration support, so placement is best effort and cannot be guaranteed at the far left.
es: Mantén pulsado Command mientras arrastras para cambiar la posición. La app solo usa la restauración pública de macOS, por lo que la posición se recupera en la medida de lo posible y no se garantiza que quede siempre a la izquierda.
fr: Maintenez Command pendant le déplacement pour changer la position. L’app utilise uniquement la restauration publique de macOS ; le rétablissement est donc au mieux et la position tout à gauche ne peut pas être garantie.
ja: Command キーを押しながらドラッグすると位置を変更できます。アプリは macOS の公開復元機能のみを使用するため、位置の復元はベストエフォートで、常に左端に固定されることは保証できません。
ko: Command 키를 누른 채 드래그하여 위치를 조정할 수 있습니다. 앱은 macOS의 공개 복원 기능만 사용하므로 위치 복원은 최선의 방식으로 이루어지며 항상 맨 왼쪽에 고정된다고 보장할 수 없습니다.
zh_hans: 按住 Command 拖动可调整位置。App 仅使用 macOS 公开的恢复机制，因此位置只能尽力恢复，无法保证始终固定在最左侧。

# settings.percentage.remaining
source: 剩餘
de: Verbleibend
en: Remaining
es: Restante
fr: Restant
ja: 残り
ko: 남음
zh_hans: 剩余

# settings.percentage.used
source: 已使用
de: Verwendet
en: Used
es: Usado
fr: Utilisé
ja: 使用済み
ko: 사용됨

# settings.menu_bar.window_retired_title
source: %@ · 目前未提供
de: %@ · Derzeit nicht verfügbar
en: %@ · Currently unavailable
es: %@ · No disponible actualmente
fr: %@ · Indisponible actuellement
ja: %@ · 現在利用できません
ko: %@ · 현재 사용할 수 없음
zh_hans: %@ · 当前未提供

# settings.appearance.system
source: 跟隨系統
de: Systemeinstellung
en: Follow System
es: Seguir el sistema
fr: Suivre le système
ja: システムに従う
ko: 시스템 설정 따르기
zh_hans: 跟随系统

# settings.accessibility.preview_label
source: 5 小時額度
de: 5-Stunden-Kontingent
en: 5-hour quota
es: Cuota de 5 horas
fr: Quota sur 5 heures
ja: 5時間の使用量
ko: 5시간 할당량
zh_hans: 5 小时额度

# settings.accessibility.standard
source: 使用標準外觀
de: Standarddarstellung wird verwendet
en: Using standard appearance
es: Usando la apariencia estándar
fr: Apparence standard utilisée
ja: 標準の外観を使用
ko: 표준 모양 사용
zh_hans: 使用标准外观

# settings.accessibility.increase_contrast
source: 已啟用增加對比的替代顯示
de: Die Ersatzdarstellung mit erhöhtem Kontrast ist aktiviert
en: Increase Contrast fallback is enabled
es: La alternativa de aumento de contraste está activada
fr: Le mode de secours de contraste accru est activé
ja: コントラストを上げるフォールバックが有効です
ko: 대비 증가 대체 표시가 활성화됨
zh_hans: 已启用增强对比度后备方案

# settings.accessibility.reduce_transparency
source: 已啟用降低透明度的替代顯示
de: Die Ersatzdarstellung mit reduzierter Transparenz ist aktiviert
en: Reduce Transparency fallback is enabled
es: La alternativa de reducción de transparencia está activada
fr: Le mode de secours de transparence réduite est activé
ja: 透明度を下げるフォールバックが有効です
ko: 투명도 줄이기 대체 표시가 활성화됨
zh_hans: 已启用降低透明度后备方案

# settings.accessibility.both_fallbacks
source: 已啟用增加對比與降低透明度的替代顯示
de: Die Ersatzdarstellungen mit erhöhtem Kontrast und reduzierter Transparenz sind aktiviert
en: Increase Contrast and Reduce Transparency fallbacks are enabled
es: Las alternativas de aumento de contraste y reducción de transparencia están activadas
fr: Les modes de secours de contraste accru et de transparence réduite sont activés
ja: コントラストを上げる／透明度を下げるフォールバックが有効です
ko: 대비 증가 및 투명도 줄이기 대체 표시가 활성화됨
zh_hans: 已启用增强对比度和降低透明度后备方案

# settings.operation.appearance_failed
source: 無法套用外觀設定；已保留上次有效值。
de: Die Darstellungseinstellungen konnten nicht angewendet werden; der letzte gültige Wert wurde beibehalten.
en: Appearance settings could not be applied; the last valid value was kept.
es: No se pudieron aplicar los ajustes de apariencia; se conservó el último valor válido.
fr: Impossible d’appliquer les réglages d’apparence ; la dernière valeur valide a été conservée.
ja: 外観設定を適用できませんでした。前回の有効な値を保持しました。
ko: 모양 설정을 적용할 수 없어 마지막 유효한 값을 유지했습니다.
zh_hans: 无法应用外观设置；已保留上次有效值。

# settings.operation.theme_apply_failed
source: 無法套用主題。
de: Das Theme konnte nicht angewendet werden.
en: The theme could not be applied.
es: No se pudo aplicar el tema.
fr: Impossible d’appliquer le thème.
ja: テーマを適用できませんでした。
ko: 테마를 적용할 수 없습니다.
zh_hans: 无法应用主题。

# settings.operation.login_unexpected
source: 系統回報過程異常；已依目前狀態顯示。
de: Das System meldete ein unerwartetes Ergebnis; der aktuelle Status wird angezeigt.
en: The system reported an unexpected result; the current state is shown.
es: El sistema devolvió un resultado inesperado; se muestra el estado actual.
fr: Le système a renvoyé un résultat inattendu ; l’état actuel est affiché.
ja: システムから予期しない結果が返されました。現在の状態を表示しています。
ko: 시스템에서 예기치 않은 결과를 반환하여 현재 상태를 표시합니다.
zh_hans: 系统报告过程异常；已按当前状态显示。

# settings.operation.theme_reset_failed
source: 無法重設主題。
de: Das Theme konnte nicht zurückgesetzt werden.
en: The theme could not be reset.
es: No se pudo restablecer el tema.
fr: Impossible de réinitialiser le thème.
ja: テーマをリセットできませんでした。
ko: 테마를 재설정할 수 없습니다.
zh_hans: 无法重置主题。

# settings.operation.theme_import_unavailable
source: 主題匯入功能尚未可用。
de: Der Theme-Import ist noch nicht verfügbar.
en: Theme import is not available yet.
es: La importación de temas aún no está disponible.
fr: L’importation de thèmes n’est pas encore disponible.
ja: テーマの読み込みはまだ利用できません。
ko: 테마 가져오기는 아직 사용할 수 없습니다.
zh_hans: 主题导入功能暂不可用。

# settings.operation.theme_export_unavailable
source: 主題匯出功能尚未可用。
de: Der Theme-Export ist noch nicht verfügbar.
en: Theme export is not available yet.
es: La exportación de temas aún no está disponible.
fr: L’exportation de thèmes n’est pas encore disponible.
ja: テーマの書き出しはまだ利用できません。
ko: 테마 내보내기는 아직 사용할 수 없습니다.
zh_hans: 主题导出功能暂不可用。

# settings.operation.save_failed
source: 無法儲存設定；已保留上次有效值。
de: Die Einstellungen konnten nicht gespeichert werden; der letzte gültige Wert wurde beibehalten.
en: Settings could not be saved; the last valid value was kept.
es: No se pudieron guardar los ajustes; se conservó el último valor válido.
fr: Impossible d’enregistrer les réglages ; la dernière valeur valide a été conservée.
ja: 設定を保存できませんでした。前回の有効な値を保持しました。
ko: 설정을 저장할 수 없어 마지막 유효한 값을 유지했습니다.
zh_hans: 无法保存设置；已保留上次有效值。

# settings.diagnostics.schema_version
source: 設定結構版本：%lld
de: Einstellungsschema-Version: %lld
en: Settings schema version: %lld
es: Versión del esquema de ajustes: %lld
fr: Version du schéma des réglages : %lld
ja: 設定スキーマバージョン：%lld
ko: 설정 스키마 버전: %lld
zh_hans: 设置结构版本：%lld

# settings.diagnostics.settings_health
source: 設定狀態：%@
de: Einstellungsstatus: %@
en: Settings health: %@
es: Estado de los ajustes: %@
fr: État des réglages : %@
ja: 設定の状態：%@
ko: 설정 상태: %@
zh_hans: 设置状态：%@

# settings.diagnostics.rate_state
source: 額度限制：%@
de: Kontingentlimits: %@
en: Quota limits: %@
es: Límites de cuota: %@
fr: Limites du quota : %@
ja: 使用量制限：%@
ko: 할당량 제한: %@
zh_hans: 额度限制：%@

# settings.diagnostics.usage_state
source: Token 活動：%@
de: Token-Aktivität: %@
en: Token activity: %@
es: Actividad de tokens: %@
fr: Activité des jetons : %@
ja: トークンアクティビティ：%@
ko: 토큰 활동: %@
zh_hans: Token 活动：%@

# settings.diagnostics.rate_last_success
source: 額度上次成功：%@
de: Letzte erfolgreiche Kontingentaktualisierung: %@
en: Last successful quota refresh: %@
es: Última actualización correcta de cuota: %@
fr: Dernière actualisation réussie du quota : %@
ja: 使用量の最終成功：%@
ko: 마지막 할당량 성공: %@
zh_hans: 额度上次成功：%@

# settings.diagnostics.usage_last_success
source: Token 上次成功：%@
de: Letzte erfolgreiche Token-Aktualisierung: %@
en: Last successful token refresh: %@
es: Última actualización correcta de tokens: %@
fr: Dernière actualisation réussie des jetons : %@
ja: トークンの最終成功：%@
ko: 마지막 토큰 성공: %@

# settings.diagnostics.login_item
source: 登入項目：%@
de: Anmeldeobjekt: %@
en: Login item: %@
es: Ítem de inicio de sesión: %@
fr: Élément d’ouverture : %@
ja: ログイン項目：%@
ko: 로그인 항목: %@
zh_hans: 登录项：%@

# settings.health.healthy
source: 正常
de: Fehlerfrei
en: Healthy
es: Correcto
fr: Sain
ko: 정상

# settings.health.migrated
source: 已遷移
de: Migriert
en: Migrated
es: Migrado
fr: Migré
ja: 移行済み
ko: 마이그레이션됨
zh_hans: 已迁移

# settings.health.using_defaults
source: 使用安全預設值
de: Sichere Standardwerte werden verwendet
en: Using safe defaults
es: Usando valores predeterminados seguros
fr: Valeurs sûres par défaut utilisées
ja: 安全なデフォルト値を使用
ko: 안전한 기본값 사용
zh_hans: 使用安全默认值

# settings.health.kept_last_valid
source: 保留上次有效設定
de: Letzte gültige Einstellungen beibehalten
en: Kept last valid settings
es: Se conservaron los últimos ajustes válidos
fr: Derniers réglages valides conservés
ja: 前回の有効な設定を保持
ko: 마지막 유효한 설정 유지
zh_hans: 保留上次有效设置

# settings.health.recovered_backup
source: 已由備份復原
de: Aus Sicherung wiederhergestellt
en: Recovered from backup
es: Recuperado desde la copia de seguridad
fr: Récupéré depuis la sauvegarde
ja: バックアップから復元済み
ko: 백업에서 복구됨
zh_hans: 已从备份恢复

# settings.health.recovered_backup_write_failed
source: 已由備份復原，回寫失敗
de: Aus Sicherung wiederhergestellt; Zurückschreiben fehlgeschlagen
en: Recovered from backup; write-back failed
es: Recuperado desde la copia; falló la reescritura
fr: Récupéré depuis la sauvegarde ; réécriture impossible
ja: バックアップから復元しましたが、書き戻しに失敗しました
ko: 백업에서 복구했지만 다시 쓰지 못함
zh_hans: 已从备份恢复，回写失败

# settings.health.write_failed
source: 寫入失敗
de: Schreiben fehlgeschlagen
en: Write failed
es: Error de escritura
fr: Échec de l’écriture
ja: 書き込みに失敗
ko: 쓰기 실패
zh_hans: 写入失败

# settings.login_state.not_registered
source: 未登錄
de: Nicht registriert
en: Not registered
es: No registrado
fr: Non enregistré
ja: 未登録
ko: 등록되지 않음
zh_hans: 未注册

# settings.login_state.requires_approval
source: 需要核准
de: Genehmigung erforderlich
en: Approval required
es: Requiere aprobación
fr: Autorisation requise
ja: 承認が必要
ko: 승인 필요
zh_hans: 需要批准

# settings.login_state.not_found
source: 找不到
de: Nicht gefunden
en: Not found
es: No encontrado
fr: Introuvable
ja: 見つかりません
ko: 찾을 수 없음
zh_hans: 未找到

# settings.tab.general
source: 一般
de: Allgemein
en: General
es: General
fr: Général
ko: 일반
zh_hans: 通用

# settings.tab.appearance
source: 外觀
de: Erscheinungsbild
en: Appearance
es: Apariencia
fr: Apparence
ja: 外観
ko: 모양
zh_hans: 外观

# settings.tab.advanced
source: 進階
de: Erweitert
en: Advanced
es: Avanzado
fr: Avancé
ja: 詳細
ko: 고급
zh_hans: 高级

# settings.group.providers
source: 額度來源
de: Kontingentquellen
en: Quota Sources
es: Fuentes de cuota
fr: Sources de quota
ja: 利用枠ソース
ko: 할당량 소스
zh_hans: 额度来源

# settings.providers.explanation
source: Codex 固定啟用；Claude Code 可自由勾選。勾選只會啟用本機顯示，不會修改 Claude Code 設定；額度連接需另行確認。
de: Codex bleibt aktiviert; Claude Code ist optional. Die Auswahl aktiviert nur die lokale Anzeige und ändert keine Claude-Code-Einstellungen. Die Kontingentverbindung muss separat bestätigt werden.
en: Codex stays enabled; Claude Code is optional. Selecting Claude only enables local display and does not change Claude Code settings; quota connection requires separate confirmation.
es: Codex permanece activo y Claude Code es opcional. Seleccionar Claude solo activa la visualización local y no cambia sus ajustes; la conexión de cuota requiere otra confirmación.
fr: Codex reste activé et Claude Code est facultatif. Sélectionner Claude active seulement l’affichage local sans modifier ses réglages ; la connexion du quota demande une confirmation séparée.
ja: Codex は常に有効で、Claude Code は任意です。Claude を選択してもローカル表示が有効になるだけで設定は変更されません。利用枠の接続は別途確認が必要です。
ko: Codex는 항상 활성화되며 Claude Code는 선택 사항입니다. Claude 선택은 로컬 표시만 활성화하고 설정을 변경하지 않습니다. 할당량 연결은 별도 확인이 필요합니다.
zh_hans: Codex 固定启用；Claude Code 可自由勾选。勾选只会启用本机显示，不会修改 Claude Code 设置；额度连接需另行确认。

# settings.providers.connection
source: 連線
de: Verbindung
en: Connection
es: Conexión
fr: Connexion
ja: 接続
ko: 연결
zh_hans: 连接

# settings.providers.quota
source: 額度
de: Kontingent
en: Quota
es: Cuota
fr: Quota
ja: 利用枠
ko: 할당량
zh_hans: 额度

# settings.providers.account
source: 帳號（已遮罩）
de: Konto (maskiert)
en: Account (masked)
es: Cuenta (oculta)
fr: Compte (masqué)
ja: アカウント（マスク済み）
ko: 계정(마스킹됨)
zh_hans: 账号（已遮罩）

# settings.providers.last_updated
source: 最後更新
de: Zuletzt aktualisiert
en: Last updated
es: Última actualización
fr: Dernière mise à jour
ja: 最終更新
ko: 마지막 업데이트
zh_hans: 最后更新

# settings.providers.primary_metric
source: 選單列主要額度
de: Primäres Menüleisten-Kontingent
en: Primary menu bar quota
es: Cuota principal de la barra
fr: Quota principal de la barre
ja: メニューバーの主な利用枠
ko: 메뉴 막대 기본 할당량
zh_hans: 菜单栏主要额度

# settings.providers.empty_recovery
source: 目前未選擇平台；選單列會保持中性 AI 狀態。勾選任一平台即可恢復顯示。
de: Keine Plattform ist ausgewählt. Die Menüleiste bleibt neutral, bis Sie eine auswählen.
en: No platform is selected. The menu bar stays in a neutral AI state until you select one.
es: No hay plataformas seleccionadas. La barra mantiene un estado de IA neutro hasta que elijas una.
fr: Aucune plateforme n’est sélectionnée. La barre reste dans un état IA neutre jusqu’à une sélection.
ja: プラットフォームが未選択です。選択するまでメニューバーは中立の AI 状態を保ちます。
ko: 선택한 플랫폼이 없습니다. 하나를 선택할 때까지 메뉴 막대는 중립 AI 상태를 유지합니다.
zh_hans: 目前未选择平台；菜单栏会保持中性 AI 状态。勾选任一平台即可恢复显示。

# settings.claude_relay.title
source: Claude Code 額度連接
de: Claude-Code-Kontingentverbindung
en: Claude Code quota connection
es: Conexión de cuota de Claude Code
fr: Connexion du quota Claude Code
ja: Claude Code 利用枠の接続
ko: Claude Code 할당량 연결
zh_hans: Claude Code 额度连接

# settings.claude_relay.explanation
source: 勾選 Claude Code 不會修改其設定。連接額度需另外確認；確認後會先備份，再寫入本 App 的 statusLine 指令。移除時只會在安全指紋吻合時還原，衝突則停止並保留復原資料。
de: Die Auswahl von Claude Code ändert keine Einstellungen. Die Kontingentverbindung muss separat bestätigt werden; vor dem Schreiben des statusLine-Befehls wird eine Sicherung erstellt. Beim Entfernen wird nur bei passendem Sicherheitsfingerabdruck wiederhergestellt; bei Konflikten stoppt die App und behält Wiederherstellungsdaten.
en: Selecting Claude Code does not change its settings. Connecting quota requires separate confirmation; the app backs up settings before writing its statusLine command. Removal restores only when the safety fingerprint matches, and conflicts stop without deleting recovery data.
es: Seleccionar Claude Code no cambia sus ajustes. Conectar la cuota requiere otra confirmación; la app crea una copia antes de escribir su comando statusLine. Al quitarlo solo restaura si coincide la huella de seguridad y, si hay conflicto, se detiene sin borrar los datos de recuperación.
fr: Sélectionner Claude Code ne modifie pas ses réglages. La connexion du quota demande une confirmation séparée ; l’app sauvegarde les réglages avant d’écrire sa commande statusLine. La suppression ne restaure que si l’empreinte de sécurité correspond ; en cas de conflit, elle s’arrête sans effacer les données de récupération.
ja: Claude Code を選択しても設定は変更されません。利用枠の接続には別途確認が必要で、確認後に設定をバックアップしてから本アプリの statusLine コマンドを書き込みます。削除時は安全なフィンガープリントが一致する場合だけ復元し、競合時は復元データを残して停止します。
ko: Claude Code를 선택해도 설정은 변경되지 않습니다. 할당량 연결은 별도 확인이 필요하며, 확인 후 설정을 백업한 다음 이 앱의 statusLine 명령을 기록합니다. 제거 시 안전 지문이 일치할 때만 복원하고 충돌하면 복구 데이터를 보존한 채 중지합니다.
zh_hans: 勾选 Claude Code 不会修改其设置。连接额度需另外确认；确认后会先备份，再写入本 App 的 statusLine 指令。移除时只会在安全指纹匹配时恢复，冲突则停止并保留恢复数据。

# settings.claude_relay.install
source: 連接 Claude Code 額度
de: Claude-Code-Kontingent verbinden
en: Connect Claude Code quota
es: Conectar la cuota de Claude Code
fr: Connecter le quota Claude Code
ja: Claude Code の利用枠を接続
ko: Claude Code 할당량 연결
zh_hans: 连接 Claude Code 额度

# settings.claude_relay.remove
source: 移除額度連接並還原設定
de: Verbindung entfernen und Einstellungen wiederherstellen
en: Remove connection and restore settings
es: Quitar la conexión y restaurar los ajustes
fr: Supprimer la connexion et restaurer les réglages
ja: 接続を削除して設定を復元
ko: 연결 제거 및 설정 복원
zh_hans: 移除额度连接并还原设置

# settings.claude_relay.confirm_install
source: 額度欄位只適用 Claude.ai Pro／Max，且要等該工作階段完成第一次 API 回應；五小時／七天窗口可能各自缺席，其他帳號可能永遠不會顯示額度。確認後會先備份，再寫入 Claude Code 的 statusLine 設定。是否繼續？
de: Kontingentfelder sind nur für Claude.ai Pro/Max nach der ersten API-Antwort der Sitzung verfügbar. Das 5-Stunden- oder 7-Tage-Fenster kann fehlen; bei anderen Konten wird möglicherweise nie ein Kontingent angezeigt. Nach der Bestätigung wird Claude Codes statusLine gesichert und geschrieben. Fortfahren?
en: Quota fields are available only to Claude.ai Pro/Max after that session’s first API response. Either the five-hour or seven-day window may be absent, and other accounts may never show quota. Confirming will back up, then write Claude Code’s statusLine setting. Continue?
es: Los campos de cuota solo están disponibles para Claude.ai Pro/Max después de la primera respuesta de API de esa sesión. Puede faltar la ventana de 5 horas o de 7 días, y otras cuentas pueden no mostrar cuota nunca. Al confirmar se hará una copia y se escribirá statusLine de Claude Code. ¿Continuar?
fr: Les champs de quota sont réservés à Claude.ai Pro/Max après la première réponse API de la session. La fenêtre de 5 heures ou de 7 jours peut manquer, et les autres comptes peuvent ne jamais afficher de quota. La confirmation sauvegardera puis écrira le réglage statusLine de Claude Code. Continuer ?
ja: 使用量フィールドは Claude.ai Pro／Max のみ対象で、そのセッションの最初の API 応答後に表示されます。5時間／7日間のどちらかがない場合があり、対象外のアカウントでは表示されないことがあります。確認するとバックアップ後に Claude Code の statusLine 設定を書き込みます。続けますか？
ko: 할당량 필드는 Claude.ai Pro/Max에서만 해당 세션의 첫 API 응답 후 제공됩니다. 5시간/7일 창 중 하나가 없을 수 있으며 대상이 아닌 계정에는 할당량이 표시되지 않을 수 있습니다. 확인하면 백업 후 Claude Code statusLine 설정을 기록합니다. 계속할까요?
zh_hans: 额度字段只适用于 Claude.ai Pro／Max，且要等该会话完成第一次 API 响应；五小时／七天窗口可能各自缺失，其他账号可能永远不会显示额度。确认后会先备份，再写入 Claude Code 的 statusLine 设置。是否继续？

# settings.claude_relay.confirm_remove
source: 確認後會移除本 App 的連接，並還原安裝前的 Claude Code 設定。是否繼續？
de: Nach der Bestätigung wird die Verbindung entfernt und die frühere Claude-Code-Einstellung wiederhergestellt. Fortfahren?
en: Confirming will remove this app’s connection and restore the prior Claude Code settings. Continue?
es: Al confirmar se quitará la conexión y se restaurarán los ajustes anteriores de Claude Code. ¿Continuar?
fr: La confirmation supprimera la connexion et restaurera les réglages Claude Code précédents. Continuer ?
ja: 確認するとこのアプリの接続を削除し、以前の Claude Code 設定を復元します。続けますか？
ko: 확인하면 이 앱의 연결을 제거하고 이전 Claude Code 설정을 복원합니다. 계속할까요?
zh_hans: 确认后会移除本 App 的连接，并还原安装前的 Claude Code 设置。是否继续？

# settings.claude_relay.state.not_installed
source: 尚未連接
de: Nicht verbunden
en: Not connected
es: Sin conexión
fr: Non connecté
ja: 未接続
ko: 연결되지 않음
zh_hans: 尚未连接

# settings.claude_relay.state.installed
source: 已連接（可還原）
de: Verbunden (wiederherstellbar)
en: Connected (restorable)
es: Conectado (restaurable)
fr: Connecté (restaurable)
ja: 接続済み（復元可能）
ko: 연결됨(복원 가능)
zh_hans: 已连接（可还原）

# settings.claude_relay.state.conflict
source: 偵測到既有或衝突設定；未進行修改
de: Vorhandene oder widersprüchliche Einstellungen erkannt; nichts geändert
en: Existing or conflicting settings detected; nothing changed
es: Se detectaron ajustes existentes o en conflicto; no se cambió nada
fr: Réglages existants ou conflictuels détectés ; aucune modification
ja: 既存または競合する設定を検出しました。変更していません
ko: 기존 또는 충돌 설정이 감지되어 변경하지 않음
zh_hans: 检测到现有或冲突设置；未进行修改
